c = input()
l = len(c)     # Длина строки
fl = 0         # Флаг правильности введённой строки

if l == 2:
    di = c[0]  # Изначальная первая цифра (десятки)
    ei = c[1]  # Изначальная вторая цифра (единицы)

# Усли введена строка длиной 1
if l == 1:
    fl = 2
    if c == '0':
        print('Нуль')
    elif c == '1':
        print('Один')
    elif c == '2':
        print('Два')
    elif c == '3':
        print('Три')
    elif c == '4':
        print('Четыре')
    elif c == '5':
        print('Пять')
    elif c == '6':
        print('Шесть')
    elif c == '7':
        print('Семь')
    elif c == '8':
        print('Восемь')
    elif c == '9':
        print('Девять')
    else:
        fl = 1

# Если введена строка длиной 2
elif l == 2:
    if ei == '1' or ei == '0':                             # Проверка для единиц
        e = 'один'
    elif ei == '2':
        e = 'два'
    elif ei == '3':
        e = 'три'
    elif ei == '4':
        e = 'четыре'
    elif ei == '5':
        e = 'пять'
    elif ei == '6':
        e = 'шесть'
    elif ei == '7':
        e = 'семь'
    elif ei == '8':
        e = 'восемь'
    elif ei == '9':
        e = 'девять'
    else:
        fl = 1                                             # Конец проверки единиц
    if di == '1':                                          # Проверка для десятков
        fl = 2
        if ei == '1':
            print('Одиннадцать')
        elif ei == '2':
            print('Двенадцать')
        elif ei == '3':
            print('Тринадцать')
        elif ei == '4':
            print('Четырнадцать')
        elif ei == '5':
            print('Пятнадцать')
        elif ei == '6':
            print('Шестнадцать')
        elif ei == '7':
            print('Семнадцать')
        elif ei == '8':
            print('Восемнадцать')
        elif ei == '9':
            print('Девятнадцать')
    elif di == '2':
        d = 'Двадцать'
    elif di == '3':
        d = 'Тридцать'
    elif di == '4':
        d = 'Сорок'
    elif di == '5':
        d = 'Пятьдесят'
    elif di == '6':
        d = 'Шестьдесят'
    elif di == '7':
        d = 'Семьдесят'
    elif di == '8':
        d = 'Восемьдесят'
    elif di == '9':
        d = 'Девяносто'
    else:
        fl = 1                                                # Конец проверки для десятков
else:
    fl = 1

# Проверка флага правильности ввода и сам вывод числа
if fl == 0:
        if ei == '0':
            print(str(d))
        elif ei != '0':
            print(str(d) + ' ' + str(e))
elif fl == 1:
    print("Вы должны ввести число меньше 100")